newcreatmao/project/32project/HAL/程序源码/2.STM32CubeMx_SD_Fatfs_USB/STM32CubeMx_SD_Fatfs.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F7
ProjectManager.MainLocation=Core/Src
RCC.USART1Freq_Value=60000000
RCC.SAI1Freq_Value=160000000
RCC.CortexFreq_Value=120000000
FATFS._USE_LFN=2
RCC.PWREXT_OverDrive=PWREXT_OverDrive_ACTIVATED
Dma.SDMMC1_RX.0.MemInc=DMA_MINC_ENABLE
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F767IGTx
FATFS0.BSP.semaphore=
FATFS0.BSP.api=Unknown
VP_FATFS_VS_SDIO.Mode=SDIO
RCC.PLLCLKFreq_Value=120000000
PC10.Signal=SDMMC1_D2
PC12.Signal=SDMMC1_CK
RCC.PLLQCLKFreq_Value=48000000
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-MX_DMA_Init-DMA-false-HAL-true,3-SystemClock_Config-RCC-false-HAL-false,4-MX_SDMMC1_SD_Init-SDMMC1-false-HAL-true,5-MX_FATFS_Init-FATFS-false-HAL-false,6-MX_USART1_UART_Init-USART1-false-HAL-true,7-MX_USB_HOST_Init-USB_HOST-false-HAL-false,0-MX_CORTEX_M7_Init-CORTEX_M7-false-HAL-true
USB_HOST0.BSP.condition=
PA11.Mode=Host_Only
SDMMC1.ClockDiv=2
PB0.GPIO_Label=LED_DS1
RCC.PLLI2SRCLKFreq_Value=160000000
RCC.USART2Freq_Value=30000000
Dma.SDMMC1_RX.0.Instance=DMA2_Stream3
Dma.SDMMC1_RX.0.FIFOMode=DMA_FIFOMODE_ENABLE
Dma.SDMMC1_RX.0.Priority=DMA_PRIORITY_HIGH
USART1.IPParameters=VirtualMode-Asynchronous
PinOutPanel.RotationAngle=0
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x1000
Dma.SDMMC1_TX.1.FIFOThreshold=DMA_FIFO_THRESHOLD_FULL
RCC.I2C3Freq_Value=30000000
RCC.LPTIM1Freq_Value=30000000
Mcu.IP4=RCC
RCC.FCLKCortexFreq_Value=120000000
Mcu.IP5=SDMMC1
Mcu.IP2=FATFS
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.SDMMC1_IRQn=true\:1\:0\:true\:false\:true\:true\:true
Mcu.IP3=NVIC
Mcu.IP0=CORTEX_M7
Mcu.IP1=DMA
PA12.Signal=USB_OTG_FS_DP
Mcu.UserConstants=
VP_FATFS_VS_SDIO.Signal=FATFS_VS_SDIO
RCC.LCDTFTFreq_Value=80000000
RCC.SDMMCFreq_Value=48000000
Mcu.ThirdPartyNb=0
PH0/OSC_IN.Mode=HSE-External-Oscillator
RCC.HCLKFreq_Value=120000000
RCC.I2C4Freq_Value=30000000
Mcu.IPNb=10
RCC.PLLI2SRoutputFreq_Value=160000000
ProjectManager.PreviousToolchain=
RCC.APB2TimFreq_Value=120000000
RCC.SPDIFRXFreq_Value=160000000
USB_HOST0.BSP.component=
PH1/OSC_OUT.Signal=RCC_OSC_OUT
Mcu.Pin6=PC8
RCC.SAI2Freq_Value=160000000
Mcu.Pin7=PC9
Mcu.Pin8=PA9
Mcu.Pin9=PA10
RCC.VCOSAIOutputFreq_Value=320000000
USB_HOST0.BSP.ip=GPIO
RCC.AHBFreq_Value=120000000
FATFS0.BSP.ip=GPIO
Mcu.Pin0=PE2
Mcu.Pin1=PE3
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PH0/OSC_IN
Mcu.Pin3=PH1/OSC_OUT
RCC.USART3Freq_Value=30000000
Mcu.Pin4=PB0
Mcu.Pin5=PB1
RCC.PLLSAIRCLKFreq_Value=160000000
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=25000000
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
USB_OTG_FS.phy_itface=HCD_PHY_EMBEDDED
FATFS0.BSP.i2caddr=0
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
ProjectManager.FirmwarePackage=STM32Cube FW_F7 V1.16.0
MxDb.Version=DB.6.0.0
PB0.GPIOParameters=GPIO_Label
ProjectManager.BackupPrevious=false
RCC.VCOInputFreq_Value=1666666.6666666667
PB1.GPIO_Label=LED_DS0
File.Version=6
PC9.Mode=SD_4_bits_Wide_bus
PE3.GPIOParameters=GPIO_Label
PE3.Locked=true
PE2.Signal=GPIO_Input
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
USB_HOST0.BSP.i2creg=
PH1/OSC_OUT.Mode=HSE-External-Oscillator
Dma.RequestsNb=2
ProjectManager.HalAssertFull=false
PB0.Locked=true
ProjectManager.ProjectName=STM32CubeMx_SD_Fatfs
RCC.MCO2PinFreq_Value=120000000
USB_HOST0.BSP.i2caddr=0
Mcu.Package=LQFP176
RCC.SDMMCClockSelection=RCC_SDMMC1CLKSOURCE_CLK48
PB1.Signal=GPIO_Output
FATFS0.BSP.solution=PE2
NVIC.OTG_FS_IRQn=true\:3\:0\:true\:false\:true\:false\:true
Dma.SDMMC1_RX.0.PeriphBurst=DMA_PBURST_INC4
ProjectManager.ToolChainLocation=
RCC.LSI_VALUE=32000
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
PA10.Signal=USART1_RX
USB_OTG_FS.VirtualMode=Host_Only
RCC.DFSDMFreq_Value=60000000
PC11.Mode=SD_4_bits_Wide_bus
VP_FATFS_VS_USB.Signal=FATFS_VS_USB
USB_HOST0.BSP.name=Drive_VBUS_FS
RCC.APB2CLKDivider=RCC_HCLK_DIV2
RCC.CECFreq_Value=32786.88524590164
Dma.Request1=SDMMC1_TX
RCC.APB1TimFreq_Value=60000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Dma.SDMMC1_TX.1.MemInc=DMA_MINC_ENABLE
USB_OTG_FS.IPParameters=VirtualMode,phy_itface
RCC.DFSDMAudioFreq_Value=160000000
Dma.SDMMC1_RX.0.Mode=DMA_PFCTRL
NVIC.USART1_IRQn=true\:0\:0\:false\:false\:true\:true\:true
Dma.Request0=SDMMC1_RX
Dma.SDMMC1_RX.0.MemDataAlignment=DMA_MDATAALIGN_WORD
PE2.GPIO_Label=SD_DETECT
ProjectManager.CustomerFirmwarePackage=
RCC.PLLSAIQCLKFreq_Value=160000000
Dma.SDMMC1_TX.1.Direction=DMA_MEMORY_TO_PERIPH
Dma.SDMMC1_TX.1.Instance=DMA2_Stream6
FATFS0.BSP.STBoard=false
RCC.I2SFreq_Value=160000000
USB_HOST.IPParameters=USBH_HandleTypeDef-MSC_FS,VirtualModeFS,USBH_USE_OS-MSC_FS,USBH_DEBUG_LEVEL-MSC_FS
Dma.SDMMC1_RX.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,FIFOThreshold,MemBurst,PeriphBurst
RCC.PLLQoutputFreq_Value=48000000
ProjectManager.ProjectFileName=STM32CubeMx_SD_Fatfs.ioc
USB_HOST.USBH_USE_OS-MSC_FS=0
Dma.SDMMC1_RX.0.PeriphInc=DMA_PINC_DISABLE
RCC.UART7Freq_Value=30000000
Mcu.PinsNb=20
PA10.Mode=Asynchronous
ProjectManager.NoMain=false
PC11.Signal=SDMMC1_D3
FATFS0.BSP.mode=Input
RCC.PLLRFreq_Value=120000000
VP_USB_HOST_VS_USB_HOST_MSC_FS.Mode=MSC_FS
PC8.Signal=SDMMC1_D0
USB_HOST0.BSP.solution=PE3
PC10.Mode=SD_4_bits_Wide_bus
USB_HOST.BSP.number=1
ProjectManager.DefaultFWLocation=true
Dma.SDMMC1_RX.0.PeriphDataAlignment=DMA_PDATAALIGN_WORD
ProjectManager.DeletePrevious=true
RCC.UART8Freq_Value=30000000
RCC.APB1CLKDivider=RCC_HCLK_DIV4
USB_HOST.USBH_HandleTypeDef-MSC_FS=hUsbHostFS
RCC.PWR_Regulator_Voltage_Scale=PWR_REGULATOR_VOLTAGE_SCALE1
RCC.FamilyName=M
USB_HOST0.BSP.semaphore=
FATFS0.BSP.instance=PE2
USB_HOST0.BSP.STBoard=false
FATFS.IPParameters=_CODE_PAGE,_USE_LFN,USE_DMA_CODE_SD
USART1.VirtualMode-Asynchronous=VM_ASYNC
PA9.Mode=Asynchronous
Dma.SDMMC1_TX.1.PeriphBurst=DMA_PBURST_INC4
ProjectManager.TargetToolchain=MDK-ARM V5.27
RCC.USART6Freq_Value=60000000
FATFS0.BSP.condition=
FATFS._CODE_PAGE=936
PA9.Signal=USART1_TX
USB_HOST.USBH_DEBUG_LEVEL-MSC_FS=2
PE2.GPIOParameters=GPIO_PuPd,GPIO_Label
ProjectManager.RegisterCallBack=
RCC.USBFreq_Value=48000000
NVIC.DMA2_Stream3_IRQn=true\:2\:0\:true\:false\:true\:false\:true
NVIC.DMA2_Stream6_IRQn=true\:2\:0\:true\:false\:true\:false\:true
RCC.PLLSAIoutputFreq_Value=160000000
RCC.LSE_VALUE=32768
PB1.Locked=true
RCC.VCOI2SOutputFreq_Value=320000000
PD2.Mode=SD_4_bits_Wide_bus
FATFS.BSP.number=1
PE2.GPIO_PuPd=GPIO_PULLUP
PC12.Mode=SD_4_bits_Wide_bus
RCC.PLLSAIPCLKFreq_Value=160000000
board=custom
RCC.VCOOutputFreq_Value=240000000
ProjectManager.LastFirmware=false
USB_HOST.VirtualModeFS=Msc
FATFS.USE_DMA_CODE_SD=1
PH0/OSC_IN.Signal=RCC_OSC_IN
RCC.APB2Freq_Value=60000000
USB_HOST0.BSP.api=Unknown
RCC.UART4Freq_Value=30000000
MxCube.Version=6.0.1
RCC.I2C1Freq_Value=30000000
RCC.PLLI2SPCLKFreq_Value=160000000
FATFS0.BSP.i2creg=
RCC.RNGFreq_Value=48000000
VP_SYS_VS_Systick.Mode=SysTick
Dma.SDMMC1_RX.0.Direction=DMA_PERIPH_TO_MEMORY
RCC.EthernetFreq_Value=120000000
Dma.SDMMC1_RX.0.MemBurst=DMA_MBURST_INC4
PA9.Locked=true
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Dma.SDMMC1_TX.1.Priority=DMA_PRIORITY_HIGH
Dma.SDMMC1_TX.1.FIFOMode=DMA_FIFOMODE_ENABLE
RCC.UART5Freq_Value=30000000
ProjectManager.FreePins=false
RCC.IPParameters=AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2CLKDivider,APB2Freq_Value,APB2TimFreq_Value,CECFreq_Value,CortexFreq_Value,DFSDMAudioFreq_Value,DFSDMFreq_Value,EthernetFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI_VALUE,I2C1Freq_Value,I2C2Freq_Value,I2C3Freq_Value,I2C4Freq_Value,I2SFreq_Value,LCDTFTFreq_Value,LPTIM1Freq_Value,LSE_VALUE,LSI_VALUE,MCO2PinFreq_Value,PLLCLKFreq_Value,PLLI2SPCLKFreq_Value,PLLI2SQCLKFreq_Value,PLLI2SRCLKFreq_Value,PLLI2SRoutputFreq_Value,PLLM,PLLN,PLLQ,PLLQCLKFreq_Value,PLLQoutputFreq_Value,PLLRFreq_Value,PLLSAIPCLKFreq_Value,PLLSAIQCLKFreq_Value,PLLSAIRCLKFreq_Value,PLLSAIoutputFreq_Value,PWREXT_OverDrive,PWR_Regulator_Voltage_Scale,RNGFreq_Value,SAI1Freq_Value,SAI2Freq_Value,SDMMC2Freq_Value,SDMMCClockSelection,SDMMCFreq_Value,SPDIFRXFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,UART4Freq_Value,UART5Freq_Value,UART7Freq_Value,UART8Freq_Value,USART1Freq_Value,USART2Freq_Value,USART3Freq_Value,USART6Freq_Value,USBFreq_Value,VCOI2SOutputFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAIOutputFreq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F767I(G-I)Tx
RCC.PLLI2SQCLKFreq_Value=160000000
ProjectManager.UnderRoot=false
Mcu.IP8=USB_HOST
Mcu.IP9=USB_OTG_FS
Mcu.IP6=SYS
PC8.Mode=SD_4_bits_Wide_bus
Mcu.IP7=USART1
ProjectManager.CoupleFile=true
RCC.SYSCLKFreq_VALUE=120000000
PA12.Mode=Host_Only
Dma.SDMMC1_TX.1.MemBurst=DMA_MBURST_INC4
PA10.Locked=true
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
Dma.SDMMC1_RX.0.FIFOThreshold=DMA_FIFO_THRESHOLD_FULL
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.CompilerOptimize=6
Dma.SDMMC1_TX.1.PeriphDataAlignment=DMA_PDATAALIGN_WORD
PA11.Signal=USB_OTG_FS_DM
ProjectManager.HeapSize=0x200
Mcu.Pin15=PD2
Dma.SDMMC1_TX.1.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,FIFOThreshold,MemBurst,PeriphBurst
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=VP_FATFS_VS_SDIO
Mcu.Pin13=PC11
Mcu.Pin14=PC12
VP_FATFS_VS_USB.Mode=USB
Mcu.Pin19=VP_USB_HOST_VS_USB_HOST_MSC_FS
Dma.SDMMC1_TX.1.MemDataAlignment=DMA_MDATAALIGN_WORD
ProjectManager.ComputerToolchain=false
Mcu.Pin17=VP_FATFS_VS_USB
RCC.HSI_VALUE=16000000
Mcu.Pin18=VP_SYS_VS_Systick
RCC.PLLQ=5
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
VP_USB_HOST_VS_USB_HOST_MSC_FS.Signal=USB_HOST_VS_USB_HOST_MSC_FS
Mcu.Pin11=PA12
Mcu.Pin12=PC10
FATFS0.BSP.component=
RCC.PLLM=15
RCC.PLLN=144
Mcu.Pin10=PA11
PE2.Locked=true
PE3.Signal=GPIO_Output
PE3.GPIO_Label=USB_VBUS
PC9.Signal=SDMMC1_D1
PB1.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
SDMMC1.IPParameters=ClockDiv
PD2.Signal=SDMMC1_CMD
RCC.I2C2Freq_Value=30000000
RCC.APB1Freq_Value=30000000
RCC.SDMMC2Freq_Value=120000000
PB0.Signal=GPIO_Output
Dma.SDMMC1_TX.1.Mode=DMA_PFCTRL
Dma.SDMMC1_TX.1.PeriphInc=DMA_PINC_DISABLE
USB_HOST0.BSP.mode=Output
ProjectManager.DeviceId=STM32F767IGTx
FATFS0.BSP.name=Detect_SDIO
ProjectManager.LibraryCopy=0
PB1.GPIOParameters=GPIO_Label,GPIO_ModeDefaultOutputPP
USB_HOST0.BSP.instance=PE3
